app/controllers/playlists_controller.rb

  def index
    @playlists = Playlist.all
---
SELECT * FROM "playlists"

  def new
    @playlist = Playlist.new
    @sites = Site.all(:order => 'name')
---
SELECT * FROM "sites" ORDER BY name

  def edit
    @playlist = Playlist.find(params[:id])
---
SELECT * FROM "playlists" WHERE ("playlists"."id" = 1)