app/controllers/sites_controller.rb

SELECT * FROM "sites"
---
  def index
    @sites = Site.all

SELECT * FROM "sites" WHERE ("sites"."id" = 11)
SELECT * FROM "songs" WHERE ("songs".site_id = 11)
---
  def songs
  	@songs = Site.find(params[:id]).get_songs

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
---
  def show
    @site = Site.find(params[:id])

INSERT INTO "sites" ("name", "last_polled", "uri", "updated_at", "created_at") VALUES('Brooklyn Vegan', '2009-04-06 22:16:00', 'http://brooklynvegan.com', '2009-04-06 22:17:30', '2009-04-06 22:17:30')
---
  def create
    @site = Site.new(params[:site])

    respond_to do |format|
      if @site.save

SELECT * FROM "sites" WHERE ("sites"."id" = 1)
DELETE FROM "sites" WHERE "id" = 1
---
  def destroy
    @site = Site.find(params[:id])
    @site.destroy